bazelbuild.vscode-bazel
charliermarsh.ruff
cschlosser.doxdocgen
davidanson.vscode-markdownlint
dbaeumer.vscode-eslint
ecmel.vscode-html-css
editorconfig.editorconfig
eriklynd.json-tools
esbenp.prettier-vscode
foxundermoon.shell-format
golang.go
hangxingliu.vscode-systemd-support
jeff-hykin.better-cpp-syntax
jeff-hykin.better-shellscript-syntax
lextudio.restructuredtext
llvm-vs-code-extensions.vscode-clangd
mhutchie.git-graph
ms-azuretools.vscode-containers
ms-dotnettools.csdevkit
ms-dotnettools.csharp
ms-dotnettools.vscode-dotnet-runtime
ms-kubernetes-tools.vscode-kubernetes-tools
ms-python.autopep8
ms-python.black-formatter
ms-python.debugpy
ms-python.flake8
ms-python.gather
ms-python.isort
ms-python.mypy-type-checker
ms-python.pylint
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode.cmake-tools
ms-vscode.cpp-devtools
ms-vscode.cpptools
ms-vscode.cpptools-extension-pack
ms-vscode.cpptools-themes
ms-vscode.hexeditor
ms-vscode.js-debug-nightly
ms-vscode.makefile-tools
ms-vscode.powershell
ms-vscode.remote-explorer
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
redhat.java
redhat.vscode-xml
redhat.vscode-yaml
rust-lang.rust-analyzer
samuelcolvin.jinjahtml
shardulm94.trailing-spaces
streetsidesoftware.code-spell-checker
tamasfe.even-better-toml
timonwong.shellcheck
twxs.cmake
vadimcn.vscode-lldb
vscjava.vscode-gradle
vscjava.vscode-java-debug
vscjava.vscode-java-dependency
vscjava.vscode-java-test
vscjava.vscode-maven
vscode-icons-team.vscode-icons
vscodevim.vim
waderyan.gitblame
xshrim.txt-syntax
yzhang.markdown-all-in-one
